DROP DATABASE IF EXISTS zakupki;
CREATE DATABASE zakupki CHARACTER SET utf8 COLLATE utf8_general_ci;
USE zakupki;



DROP TABLE IF EXISTS procedure_types;
CREATE TABLE procedure_types(
	id SERIAL PRIMARY KEY,
	`type` VARCHAR(255) NOT NULL UNIQUE-- Название
); 


DROP TABLE IF EXISTS sites;
CREATE TABLE sites(
	id SERIAL PRIMARY KEY,
	`type` VARCHAR(255) NOT NULL UNIQUE-- Название
); 


DROP TABLE IF EXISTS stages;
CREATE TABLE stages(
	id SERIAL PRIMARY KEY,
	`type` VARCHAR(255) NOT NULL UNIQUE-- Название
); 


DROP TABLE IF EXISTS customers;
CREATE TABLE customers(
	id SERIAL PRIMARY KEY,
	name TEXT NOT NULL,-- Название
	adress TEXT NOT NULL,
	mail	VARCHAR(150) NOT NULL UNIQUE,
	phone VARCHAR(20) NOT NULL UNIQUE
); 

DROP TABLE IF EXISTS notices;
CREATE TABLE notices (
	id SERIAL PRIMARY KEY, -- SERIAL = BIGINT UNSIGNED NOT NULL AUTO_INCREMENT UNIQUE
    `number` BIGINT UNSIGNED NOT NULL UNIQUE, -- номер извещения
	procedure_type_id BIGINT UNSIGNED NOT NULL, -- Тип закупки
	site_id BIGINT UNSIGNED NOT NULL, -- Площадка
	name TEXT NOT NULL, -- Имя закупки
	stage_id BIGINT UNSIGNED NOT NULL, -- Этап закупки
	customer_id BIGINT UNSIGNED NOT NULL,-- заказчик
	end_date DATETIME NOT NULL, -- Дата окончания приема заявок
	first_part_date DATETIME,-- Срок рассмотрения первых частей
	auction_date DATETIME,-- Срок проведения аукциона
	second_parts_time DATETIME,-- Срок рассмотрения вторых частей
	price BIGINT UNSIGNED NOT NULL, -- НМЦК
	finance VARCHAR(255), -- Источник финансирования
	icode BIGINT UNSIGNED NOT NULL UNIQUE, -- ИКЗ
	application_pledge BIGINT UNSIGNED, -- Обеспечение контракта
	contract_pledge BIGINT UNSIGNED, -- Обеспечение заявки
	guarantee_pledge BIGINT UNSIGNED, -- Обеспечение гарантийных обязательств
	INDEX notice_number(number),
	FOREIGN KEY (procedure_type_id) REFERENCES procedure_types(id), -- ON DELETE RESTRICT ON UPDATE CASCADE,
	FOREIGN KEY (site_id) REFERENCES sites(id), -- ON DELETE RESTRICT ON UPDATE CASCADE,
	FOREIGN KEY (stage_id) REFERENCES stages(id), -- ON DELETE RESTRICT ON UPDATE CASCADE,
	FOREIGN KEY (customer_id) REFERENCES customers(id) -- ON DELETE RESTRICT ON UPDATE CASCADE
);

DROP TABLE IF EXISTS documentation;
CREATE TABLE documentation(
	id SERIAL PRIMARY KEY,
	notice_id BIGINT UNSIGNED NOT NULL,
	`date` DATETIME NOT NULL DEFAULT NOW(),
	file_name VARCHAR(255) NOT NULL,
	FOREIGN KEY (notice_id) REFERENCES notices(id) ON DELETE CASCADE
);

DROP TABLE IF EXISTS protocol_types;
CREATE TABLE protocol_types(
	id SERIAL PRIMARY KEY,
	`type` VARCHAR(255) NOT NULL UNIQUE-- Название
); 

DROP TABLE IF EXISTS protocols;
CREATE TABLE protocols(
	id SERIAL PRIMARY KEY,
	notice_id BIGINT UNSIGNED NOT NULL,
	protocol_type_id BIGINT UNSIGNED NOT NULL,
	`date` DATETIME NOT NULL DEFAULT NOW(),
	file_name VARCHAR(255) NOT NULL,

	FOREIGN KEY (notice_id) REFERENCES notices(id) ON DELETE CASCADE,
	FOREIGN KEY (protocol_type_id) REFERENCES protocol_types(id) ON DELETE RESTRICT ON UPDATE CASCADE
);





DROP TABLE IF EXISTS restricts_types;
CREATE TABLE restricts_types(
	id SERIAL PRIMARY KEY,
	name VARCHAR(255) NOT NULL
);

DROP TABLE IF EXISTS restricts;
CREATE TABLE restricts(
	id SERIAL PRIMARY KEY,
	notice_id BIGINT UNSIGNED NOT NULL,
	restrict_types_id BIGINT UNSIGNED NOT NULL,
	FOREIGN KEY (notice_id) REFERENCES notices(id) ON DELETE CASCADE,
	FOREIGN KEY (restrict_types_id) REFERENCES restricts_types(id) ON DELETE CASCADE
);
	

	


use zakupki;



insert into procedure_types (`type`) VALUES
	( 'Электронный аукцион'),
	( 'Запрос котировок'),
	( 'Конкурс в электронной форме'),
	( 'Закупка у единственного поставщика');



insert into sites (`type`) VALUES
	( 'Сбербанк-АСТ'),
	('РТС Тендер'),
	('Росэлторг'),
	('Заказ РФ'),
	('ТЭК Торг'),
	('ЭТП ЕТС');



insert into stages (`type`) VALUES
	( 'Подача заявок'),
('Работа комиссии'),
('Закупка завершена'),
('Закупка отменена')
;



insert into customers (name, adress, mail, phone) VALUES
	( 'ФГБУ Росгеолфонд','г. Москва, 3-я Магистральная 38','rfgf@rfgf.ru','+7 499 455 67 67'),
( 'Федеральное агентство научных организаций','г. Вуктыл, ул. Пекуновский Тупик, дом 37','bediwe5931@xmailweb.com','8 (900) 687-42-31'),
( 'Министерство спорта Российской Федерации','г. Холм, ул. Проектируемый 856-й Проезд, дом 36','teterin@agriculture.ru','8 (903) 861-78-40'),
( 'Федеральная служба по финансовому мониторингу',' г. Знаменск, ул. Фомичевой, дом 37,','lawpro-707@list.ru','8 (951) 540-19-16'),
( 'Верховный Суд Российской Федерации',' г. Чусовой, ул. Федеративный Проспект, дом 23','solowey011@yandex.ru ','8 (961) 648-46-24'),
( 'Конституционный Суд Российской Федерации',' г. Шимск, ул. Скотопрогонная 2-я, дом 13','workpost@fxt.ru','8 (932) 415-91-32'),
( 'Фонд социального страхования Российской Федерации','г. Мещовск, ул. Барыковский Переулок, дом 47','alukoshkin@ya.ru','8 (932) 425-91-32'),
( 'Пенсионный фонд Российской Федерации','г. Верховье, ул. Мещерский Поселок, дом 7','gnyhitkif@yahoo.com','8 (955) 173-50-21'),
( 'Федеральное агентство по делам национальностей','г. Знаменск, ул. Фомичева, дом 34','xyz444@yandex.ru','8 (961) 440-39-99'),
( 'Федеральная служба судебных приставов','г. Москва ул. Скаковая 34к1','aertrhuejp@bk.ru ','8 (946) 912-21-55'),
( 'Министерство юстиции Российской Федерации','г. Москва, ул. Введенского 26',' juosldgtec@bk.ru ','8 (933) 785-67-93'),
( 'Счетная палата Российской Федерации','г. Карабудахкент, ул. Старокирочный Переулок, дом 95',' rassilka01@bk.ru ','8 (912) 779-88-65'),
( 'Федеральная служба безопасности Российской Федерации','г. Партизанское, ул. Тропаревская, дом 82',' antioch@cmail.ru','8 (941) 604-34-96')
;



insert into notices (`number`, procedure_type_id, site_id, name, stage_id, customer_id, end_date, first_part_date,
	auction_date,second_parts_time,price,finance,icode, application_pledge, contract_pledge, guarantee_pledge) VALUES
	(0161300003319000245, 1, 1, 'Поставка',1,1, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	1000001, 'budget', 1412323123,100,1000,100),
(0161300003319000246, 1, 1, 'Поставка бытовых товаров',1,1, '2019-12-11 10:10:10', '2019-12-12 10:10:10', '2019-12-13 10:10:10','2019-12-14 10:10:10',
	98763561, 'Федеральный бюджет', 643634123123,100,1000,100),
(0161300003319000247, 1, 1, 'Поставка бытовых товаров',1,8, '2019-12-11 10:10:10', '2019-12-12 10:10:10', '2019-12-10 10:10:10','2019-12-10 10:10:10',
	652341234, 'Федеральный бюджет', 1232453123,100,1000,100),
(0161300003319000248, 1, 1, 'Поставка бытовых товаров',1,7, '2019-12-11 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:10:10','2019-12-12 10:10:10',
	654820, 'Федеральный бюджет', 631123123,100,1000,100),
(0161300003319000251, 1, 1, 'Поставка бытовых товаров',1,6, '2019-12-10 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:12:10','2019-12-10 10:10:10',
	542310, 'Средства бюджетного учреждения', 123765856123,100,1000,100),
(0161300003319000252, 1, 1, 'Поставка бытовых товаров',1,5, '2019-12-10 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:10:10','2019-12-10 10:10:10',
	4326123, 'Средства бюджетного учреждения', 9766123123,100,1000,100),
(0161300003319000254, 1, 1, 'Поставка канцелярских товаров',1,4, '2019-12-10 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:10:10','2019-12-10 10:10:10',
	423612, 'Средства бюджетного учреждения', 76906123123,100,1000,100),
(0161300003319000256, 1, 1, 'Поставка канцелярских товаров',1,3, '2019-12-10 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:10:10','2019-12-10 10:10:10',
	12354634, 'Субсидия на выполнения госзадания', 67890123123,100,1000,100),
(0161300003319000257, 1, 1, 'Поставка канцелярских товаров',1,2, '2019-12-10 10:10:10', '2019-12-10 10:10:10', '2019-12-10 10:10:10','2019-12-10 10:10:10',
	9752764, 'Субсидия на выполнения госзадания', 346123123,100,1000,100),
(0161300003319000258, 1, 1, 'Поставка канцелярских товаров',1,1, '2019-12-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	6433666, 'Субсидия на выполнения госзадания', 1233245123,100,1000,100),
(0161300003319000259, 1, 1, 'Поставка канцелярских товаров',1,9, '2019-12-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	55786, 'Субсидия на выполнения госзадания', 123754123,100,1000,100),
(0161300003319000201, 1, 1, 'Оказание услуг по уборке помещений',1,8, '2019-12-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	21634247, 'Федеральный бюджет', 12384532123,100,1000,100),
(0161300003319000202, 1, 2, 'Оказание услуг по уборке помещений',2,7, '2019-11-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	2352162340, 'Федеральный бюджет', 122373123,100,1000,100),
(0161300003319000203, 1, 2, 'Оказание услуг по уборке помещений',2,5, '2019-11-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	1246230, 'Федеральный бюджет', 18569723123,100,1000,100),
(0161300003319000204, 1, 2, 'Оказание услуг по уборке помещений',2,4, '2019-11-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	5324745, 'Федеральный бюджет', 1231956023,100,1000,100),
(0161300003319000205, 1, 2, 'Оказание услуг по охране зданий',2,6, '2019-11-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	2346123, 'Федеральный бюджет', 125963123,100,1000,100),
(0161300003319000206, 1, 3, 'Оказание услуг по охране зданий',3,3, '2019-08-10 10:10:10', '2019-09-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	673412345, 'Федеральный бюджет', 122343243123,100,1000,100),
(0161300003319000207, 1, 2, 'Оказание услуг по охране зданий',4,2, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	222656721, 'Федеральный бюджет', 1223483123,100,1000,100),
(0161300003319000208, 1, 3, 'Оказание услуг по охране зданий',4,1, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	21354860, 'Федеральный бюджет', 123789123,100,1000,100),
(0161300003319000209, 1, 2, 'Поставка  компьютерной техники',2,11, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	23148560, 'Федеральный бюджет', 12789023123,100,1000,100),
(0161300003319000211, 1, 2, 'Поставка  компьютерной техники',1,12, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	11243000, 'Федеральный бюджет', 14323123,100,1000,100),
(0161300003319000212, 1, 3, 'Поставка  компьютерной техники',1,13, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	16200, 'Федеральный бюджет', 123122363,100,1000,100),
(0161300003319000213, 1, 2, 'Поставка  компьютерной техники',1,1, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	2360000, 'Федеральный бюджет', 1232134123,100,1000,100),
(0161300003319000214, 1, 4, 'Поставка  компьютерной техники',1,3, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	23640000, 'Федеральный бюджет', 74123123,100,1000,100),
(0161300003319000215, 1, 4, 'Поставка  компьютерной техники',1,2, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	21432000, 'Федеральный бюджет', 924123123,100,1000,100),
(0161300003319000216, 1, 5, 'Поставка  компьютерной техники',1,6, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	214321000, 'Федеральный бюджет', 923123123,100,1000,100),
(0161300003319000217, 1, 5, 'Поставка  компьютерной техники',1,5, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	64370, 'Федеральный бюджет', 2134123123,100,1000,100),
(0161300003319000218, 2, 6, 'Поставка  компьютерной техники',1,4, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	217100, 'Федеральный бюджет', 549123123,100,1000,100),
(0161300003319000219, 2, 1, 'Поставка ГСМ',1,7, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	41262000, 'Федеральный бюджет', 214123123,100,1000,100),
(0161300003319000221, 2, 1, 'Поставка ГСМ',2,8, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	23450, 'Федеральный бюджет', 12384123,100,1000,100),
(0161300003319000222, 3, 1, 'Поставка ГСМ',2,9, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	23500, 'Федеральный бюджет', 1456062823123,100,1000,100),
(0161300003319000223, 3, 1, 'Поставка ГСМ',3,10, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	231500, 'Федеральный бюджет', 120113123,100,1000,100),
(0161300003319000224, 3, 1, 'Поставка ГСМ',1,11, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	21525300, 'Федеральный бюджет', 134623123,100,1000,100),
(0161300003319000225, 3, 1, 'Работы по ремонту помещений',1,12, '2019-12-12 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	1234120, 'Федеральный бюджет', 123634734123,100,1000,100),
(0161300003319000226, 3, 1, 'Работы по ремонту помещений',1,3, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	2123120, 'Федеральный бюджет', 12743343123,100,1000,100),
(0161300003319000227, 3, 1, 'Работы по ремонту помещений',1,1, '2019-10-10 10:10:10', '2019-10-10 10:10:10', '2019-10-10 10:10:10','2019-10-10 10:10:10',
	2512530, 'Федеральный бюджет', 1212357893123,100,1000,100);





insert into documentation (notice_id, file_name) VALUES
	( 1, 'doc.doc'),
( 1, 'Документация.doc'),
( 1, 'doc.doc'),
( 24, 'Документация.doc'),
( 23, 'doc.doc'),
( 24, 'Документация.doc'),
( 4, 'Документация.doc'),
( 25, 'Документация.doc'),
( 5, 'Документация.doc'),
( 26, 'Документация.doc'),
( 6, 'Документация.doc'),
( 27, 'Документация.doc'),
( 7, 'Расчет НМЦК.doc'),
( 17, 'Расчет НМЦК.doc'),
( 8, 'Расчет НМЦК.doc'),
( 29, 'Расчет НМЦК.doc'),
( 9, 'doc.doc'),
( 1, 'Расчет НМЦК.doc'),
( 2, 'Расчет НМЦК.doc'),
( 3, 'Расчет НМЦК.doc'),
( 4, 'Расчет НМЦК.doc'),
( 5, 'Расчет НМЦК.doc'),
( 6, 'Расчет НМЦК.doc'),
( 7, 'Расчет НМЦКc.doc'),
( 8, 'Расчет НМЦК.doc'),
( 9, 'Расчет НМЦК.doc'),
( 1, 'Техническое задание.doc'),
( 12, 'Техническое задание.doc'),
( 13, 'Техническое задание.doc'),
( 14, 'Техническое заданиеc.doc'),
( 15, 'Документация.doc'),
( 16, 'Документация.doc'),
( 12, 'Документация.doc'),
( 13, 'doc.doc'),
( 14, 'Расчет НМЦК'),
( 15, 'Расчет НМЦК.doc'),
( 16, 'Расчет НМЦК.doc'),
( 17, 'Расчет НМЦК.doc'),
( 18, 'Документация.doc'),
( 21, 'Документация3.doc'),
( 23, 'Документация 11.10.doc');




insert into protocol_types (`type`) VALUES
	( 'Протокол рассмотрения первых частей'),
	('Протокол проведения аукциона'),
	('Протокол рассмотрения вторых частей'),
	('Протокол рассмотрения и оценки заявок заявок');





insert into protocols (notice_id, protocol_type_id,file_name) VALUES
	(1,1,'prt.txt'),
(1,1,'prt1.txt'),
(1,2,'prt2.txt'),
(1,3,'prt3.txt'),
(2,1,'prt1.txt'),
(2,2,'prt2.txt'),
(2,3,'prt3.txt'),
(4,1,'prt1.txt'),
(4,2,'prt2.txt'),
(4,3,'prt3.txt'),
(5,1,'prt1.txt'),
(5,2,'prt2.txt'),
(5,3,'prt3.txt'),
(6,1,'prt1.txt'),
(6,2,'prt2.txt'),
(6,3,'prt3.txt'),
(7,1,'prt1.txt'),
(7,2,'prt2.txt'),
(7,3,'prt3.txt'),
(9,1,'prt1.txt'),
(9,2,'prt2.txt'),
(9,3,'prt3.txt'),
(10,1,'prt1.txt'),
(10,2,'prt2.txt'),
(10,3,'prt3.txt');



insert into restricts_types (name) VALUES
	( 'Закупка у субъектов малого предпринимательства'),
( 'Закупка у организации инвалидов'),
( 'Закупка у предприятий ИСН');



insert into restricts (notice_id,restrict_types_id) VALUES
	( 1,1),
( 2,1),
( 3,2),
( 4,3),
( 6,2),
( 7,1),
( 11,1),
( 13,2),
( 15,1),
( 18,3),
( 21,3),
( 22,1),
( 23,2),
( 24,1),
( 26,2),
( 27,1),
( 28,3);
































	
	
	